Revit 2027 API
DividedSurface.NumberOfVGridlines Property
Get the number of V-gridlines used on the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfVGridlines { get; }
Public ReadOnly Property NumberOfVGridlines As Integer
	Get
public:
property int NumberOfVGridlines {
	int get ();
}
member NumberOfVGridlines : int with get
Property Value
Int32
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace